> 元气满满的一天，我从起床就在期待今天的挑战。
### 坑爹的专有名词
第一天的挑战就就这么开始了，真的是收获满满的一天。

首先先说说今天遇到的挫折好了。

今天最令我感到郁闷的就是一个专有名词自动代理。我一开始觉得“科学上网”这个任务是比较容易的，毕竟我也是老司机了，11年的网龄不是白长的。然而，我看到了四个字“自动代理”，……，什么叫自动代理，没关系，百度一下，百度不行，搜狗一下，搜狗不行，谷歌一下。但是，谷歌也没有我能看懂的答案(>﹏<)。我觉得，一定是我的打开方式不对，我得先明白什么是代理，才能明白什么是自动代理。于是继续搜搜搜，好了，我明白了什么是代理，然而我还是不知道什么是自动代理(๑˙ー˙๑)。最后，逼我使出杀手锏——问Sara姐。Sara姐只用了一句话就解决了我的问题。
于是我就简单粗暴的懂了这个任务的重点——会翻墙找资料。我这个时候才突然意识到，原来，翻墙找资料并不是一个人人都会的技能呀。哎呀，被自己莫名的优越感小自豪了一把。
### 意外发现好开心
在进行第三项任务的时候我是窃喜的，为什么呢？在一个月以前，我无意间看到了网易云课堂上半撇老师的课，然后开心的加了7天免费训练营。于是，在某一天，我花了一个下午的时间，学会了markdown的语法，外加用10几分钟是时间安装了markdownhere。这个任务over。但是在我准备下个一项任务的时候，我突然想起，要不去半撇有道儿下载一份markdown的全部语法。有的时候忘了，会方便查阅。然后，我就在官网上面发现了githu的入门教程。开心ヽ(○^㉨^)ﾉ♪，最后一个项学习任务完成。
### 发现新神器
一直以来，我在寻找一款适合我的时间管理软件，苦苦寻觅，但是总是不符合我的要求。直到今天遇到了trello
总结来说，它有一下几个有点：（这段文字主要是为了证明，我是会用markdown多级列表的语法的（*/∇＼*）
- 可以制定月计划，再在月计划里制定周计划和日计划。我一直找不到这样的软件，一般只能指定日计划。后来我都放弃改用手帐了，但是手帐不便于携带，总是中断记录。现在基本不用担心这个问题。
- 多人协作。我非常喜欢这个多人协作的功能，异地狗的福音，不解释。
- 可以添加文件和图片。加入了基本笔记的功能，我在考虑，要不要把有道笔记本卸掉了。虽然我现在是用有道笔记写的这段文字(>﹏<)。

总结这小半天的生活，感觉自己收获多多。来句鸡汤收尾：**无论做什么事，有意外就会惊喜，也许会被石头绊脚，但是往起爬的时候也会看见一朵小花自己绽放**
